In [1]:
import os

# Get the path to the directory containing the CSV file
csv_directory = '/Users/Admin/Downloads'  # Replace this with the actual path

# Set the current working directory to the directory containing the CSV file
os.chdir(csv_directory)

In [4]:
import pandas as pd
df=pd.read_csv('students.csv')
df

     0  roll_no      name class  marks   age
0    1     9501      Aadi    BE  89.06  21.0
1    2     7354    Ishita    TE  89.93  22.0
2    3     3926    Vihaan    BE  63.35  18.0
3    4     1097    Ananya    BE  76.43  22.0
4    5     5868     Aisha    BE  51.34  19.0
5    6     1539    Ishita    BE  50.85  18.0
6    7     7601     Aryan    BE  64.30  25.0
7    8     8299     Aisha    TE  88.89  21.0
8    9     3427    Vihaan    TE  93.87  25.0
9   10     3056  Aaradhya    BE  81.54  20.0
10  11     5467      Aadi   NaN    NaN   NaN
11  12     7121      Avni   NaN    NaN   NaN
12  13     8327     Advik   NaN    NaN   NaN
13  14     1822     Arjun    BE  68.79  21.0
14  15     4622     Aarav    BE  75.96  18.0
15  16     2145      Avni    BE  99.45  18.0
16  17     9153     Aisha    BE  77.28  19.0
17  18     2395    Vihaan    BE  94.85  21.0
18  19     4342    Ananya    BE  91.34  19.0
19  20     5006     Aarav    BE  96.17  23.0
20  21     8562     Aisha    TE  57.88  22.0
21  22     5806     Aditi    BE  90.21  18.0
22  23     2573    Vihaan    TE  79.59  24.0
23  24     3747   Reyansh    TE  93.59  19.0
24  25     8536    Prisha    TE  70.38  18.0
25  26     3040    Ananya    BE  60.04  24.0
26  27     6548   Reyansh   NaN    NaN   NaN
27  28     6172  Aaradhya    BE  85.44  22.0
28  29     1063     Aarav    BE  56.11  24.0
29  30     1671     Anika    TE  64.03  25.0

In [9]:
df.mean(numeric_only=True)

0            15.500000
roll_no    4992.866667
marks        77.333462
age          21.000000
dtype: float64

In [11]:
df.median(numeric_only=True)

0            15.500
roll_no    4814.000
marks        78.435
age          21.000
dtype: float64

In [12]:
df.std(numeric_only=True)

0             8.803408
roll_no    2658.494424
marks        15.152761
age           2.481935
dtype: float64

In [13]:
df.min(numeric_only=True)

0             1.00
roll_no    1063.00
marks        50.85
age          18.00
dtype: float64

In [15]:
df.max(numeric_only=True)

0            30.00
roll_no    9501.00
marks        99.45
age          25.00
dtype: float64

In [16]:
import numpy as np

In [17]:
#calculates the standard deviation of the values in the 'marks' column
np.std(df['marks'])

14.858504931081804

In [18]:
#grouping the DataFrame df based on the values in the 'class' column.
gr1 = df.groupby('class')

In [19]:
#retrieves the group associated with the class 'TE'
te = gr1.get_group('TE')

In [20]:
te.min()

0              2
roll_no     1671
name       Aisha
class         TE
marks      57.88
age         18.0
dtype: object

In [21]:
te.max()

0              30
roll_no      8562
name       Vihaan
class          TE
marks       93.87
age          25.0
dtype: object

In [22]:
gr2 = df.groupby('age')

In [23]:
gr2.groups

{18.0: [2, 5, 14, 15, 21, 24], 19.0: [4, 16, 18, 23], 20.0: [9], 21.0: [0, 7, 13, 17], 22.0: [1, 3, 20, 27], 23.0: [19], 24.0: [22, 25, 28], 25.0: [6, 8, 29]}

In [24]:
tw = gr2.get_group(20)

In [25]:
tw

    0  roll_no      name class  marks   age
9  10     3056  Aaradhya    BE  81.54  20.0

In [27]:
#interface for creating attractive and informative statistical graphics
import seaborn as sns

In [28]:
df = sns.load_dataset('iris') # loads the Iris dataset from the Seaborn library

In [29]:
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [32]:
import plotly.express as px
# Load the Iris dataset
df = px.data.iris()

In [33]:
df

,sepal_length,sepal_width,petal_length,petal_width,species,species_id
0,5.1,3.5,1.4,0.2,setosa,1
1,4.9,3.0,1.4,0.2,setosa,1
2,4.7,3.2,1.3,0.2,setosa,1
3,4.6,3.1,1.5,0.2,setosa,1
4,5.0,3.6,1.4,0.2,setosa,1
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,3
146,6.3,2.5,5.0,1.9,virginica,3
147,6.5,3.0,5.2,2.0,virginica,3
148,6.2,3.4,5.4,2.3,virginica,3
149,5.9,3.0,5.1,1.8,virginica,3

In [34]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width  species_id
count    150.000000   150.000000    150.000000   150.000000  150.000000
mean       5.843333     3.054000      3.758667     1.198667    2.000000
std        0.828066     0.433594      1.764420     0.763161    0.819232
min        4.300000     2.000000      1.000000     0.100000    1.000000
25%        5.100000     2.800000      1.600000     0.300000    1.000000
50%        5.800000     3.000000      4.350000     1.300000    2.000000
75%        6.400000     3.300000      5.100000     1.800000    3.000000
max        7.900000     4.400000      6.900000     2.500000    3.000000

In [35]:
#groups the DataFrame df by the unique values in the 'species' column 
gr = df.groupby('species')

In [36]:
se = gr.get_group('setosa')
ve = gr.get_group('versicolor')
vi = gr.get_group('virginica')

In [37]:
se.shape

(50, 6)

In [38]:
ve.shape

(50, 6)

In [39]:
vi.shape

(50, 6)